Repository: sling86/sling86.github.io
Catalog: joobsbox/Joobsbox/Languages/main/*.po
Languages: ro

source: This category does not exist.
ro: Această categorie nu există.

source: The requested job does not exist!
ro: Acest job nu există.

source: Job title:
ro: Titlul postului căutat:

source: Ex: "Flash Designer" or "ASP.NET Programmer"
ro: Ex: "Flash Designer" sau "Programator ASP.NET"

source: Company:
ro: Firma angajatoare:

source: Location:
ro: Locația:

source: Ex: "Iaşi, Bucureşti"
ro: Ex: "Iași, București"

source: Choose...
ro: Alege...

source: Category:
ro: Categoria:

source: Job description:
ro: Descrierea postului:

source: HTML code is not accepted. Length must be less than 4000 characters.
ro: Nu se acceptă cod HTML şi nu mai mult de 4000 caractere

source: Means of application:
ro: Cum va aplica un candidat:

source: Ex: "Send CV to email ..." or "Apply online at URL ..."
ro: Ex: "Trimite CV la email ...." sau "Aplică online la adresa ...."

source: Add
ro: Adaugă

source: Modify
ro: Modifică

source: You are not allowed to add the same job multiple times.
ro: Nu ai dreptul să adaugi același job de mai multe ori.

source: An error occured while saving the job. Please try again.
ro: A apărut o eroare în timpul salvării jobului. Încearcă din nou.

source: Username:
ro: Nume utilizator:

source: Password:
ro: Parola:

source: Do not check if on a public computer
ro: Nu bifa dacă te afli la un calculator public

source: Remember me:
ro: Ține-mă minte

source: Login
ro: Intră

source: Username and/or password incorrect
ro: Nume de utilizator sau parola incorecte

source: Post a job for %d days
ro: Postează anunț %d zile

source: Search here
ro: Caută aici

source: Subscribe to the full <a href="%s">RSS Feed</a> and be notified when when new jobs are posted.
ro: Înscrie-te la întregul <a href="%s">Flux RSS</a> pentru a fi notificat atunci când apar noi anunţuri.

source: Installation
ro: Instalare

source: Administration Dashboard
ro: Panou administrare

source: at
ro: la

source: in
ro: în

source: No jobs postings are available at this time. Be the first to publish one!
ro: Niciun anunţ de angajare nu este disponibil în acest moment. Fii tu primul care publică unul!

source: Installation - Step
ro: Instalare - Pasul

source: Welcome to Joobsbox installation!
ro: Bun venit la instalarea Joobsbox!

source: I need some information and then we're ready to go.
ro: Am nevoie de câteva informaţii şi apoi suntem gata.

source: Site information
ro: Informaţii site

source: Site name
ro: Nume site

source: Database information
ro: Informaţii bază de date

source: Database name
ro: Nume bază de date

source: Database username
ro: Nume utilizator

source: Database password
ro: Parolă

source: Database host
ro: Gazdă

source: Table prefix
ro: Prefix tabele

source: There was an error connecting to the database. Make sure the connection information you provided is correct.
ro: A apărut o eroare în timpul conectării la baza de date. Asigură-te că datele furnizate pentru conexiune sunt corecte.

source: Joobsbox installation complete!
ro: Joobsbox este gata instalat!

source: Congratulations. You finished installing Joobsbox. Now please configure your administrator username and password.
ro: Felicitări. Ai terminat de instalat Joobsbox. Acum configurează un nume de utilizator și o parola pentru contul tău de administrator.

source: Administrator credentials
ro: Date autentificare pentru administrator

source: Your name
ro: Numele tău

source: Username
ro: Nume utilizator

source: Password
ro: Parola

source: Please provide a valid username and password.
ro: Introdu nume de utilizator și parolă corecte

source: Done
ro: Gata

source: Everything went well!
ro: Totul a mers bine!

source: Description:
ro: Descriere:

source: To apply:
ro: Pentru a aplica:

source: Publish a job posting
ro: Publică un anunţ

source: Publish a job
ro: Publică un anunţ.

source: The job has been saved. It now has to be accepted by a moderator in order to appear publicly on the site.
ro: Jobul a fost salvat. Acum trebuie acceptat de un moderator pentru a apărea public pe site.

source: The job has been modified and saved.
ro: Postul a fost modificat și salvat.

source: Job search
ro: Căutare joburi

source: Search
ro: Căutare

source: Back to site
ro: Înapoi la site.

source: Dashboard
ro: Panou control
